load.yml
config:
  target: "https://qa.api.pwfieldtool.com"
  tls: 
    rejectUnauthorized: false
  processor: "./selectRandomEval.js"  # correct spelling
  phases:
    - name: "load testing"
      duration: 300
      arrivalRate: 2
      rampTo: 5
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "{{ $processEnvironment.AUTH_TOKEN }}"
scenarios:
  - name: "Evaluation"
    flow:
      - get:
          url: "/v1/evaluations"
          capture:
            - json: "$"  # Capture the entire response first
              as: "full_response"
            - json: "$[*].eval_id"  # Then capture eval_ids
              as: "eval_ids"
      - function: "selectRandomEval"
      # - log: "Selected eval_id: {{ eval_id }}"
      - get:
          url: "/v1/evaluations/{{ eval_id }}"
          expect:
            - statusCode: 200
      - patch:
          url: "/v1/evaluations/{{ eval_id }}"
          json:
            workflow_status: "capture_in_progress"  # Fixed typo: was "capturing_in_progress"
            owner_name: "Gary Podzemny"             # Fixed typo: was "Gary Podzemy"
            valuation_reasons:
              - "Financing"
            notes: "This is the note. Updated"
            primary_contact: "Abraham Abbey"
            primary_contact_id: "6eb6d8f9-1709-4f20-9eab-5bcf7f890116"
            owner: "garypodz@gmail.com"
            owner_id: "254000"
            location: "C"
            opportunity_id: "70460"
            fee_code: "A - $100 Listing Fee"
          expect:
            - statusCode: 200